share/man/man4/man4.i386/autoconf.4
.\"	BSDI $Id: autoconf.4,v 1.2 1993/03/23 22:56:18 polk Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)autoconf.4	6.3 (Berkeley) 3/27/91
.\"
.Dd March 27, 1991
.Dt AUTOCONF 4
.Os BSD/386
.Sh NAME
.Nm autoconf
.Nd "diagnostics from the autoconfiguration code"
.Sh DESCRIPTION
When the system
bootstraps it probes the innards of the machine
on which it is running and
locates controllers, drives, and other devices.
Each item found is recorded on the console.
This procedure is driven by a system
configuration table which is processed by
.Xr config 8
and compiled into each kernel.
.Pp
Devices are located by probing to see if their control-status
registers respond.  If not, they are silently ignored.  If the control
status register responds but the device cannot be made to interrupt, a
diagnostic warning may be printed on the console and either the
device will not be available to the system, or a default interrupt
level will be assumed.  Alternatively, interrupt autoconfiguration may
be bypassed by assigning a fixed interrupt level
.Ns ( Dq irq )
in the kernel configuration file.
The configuration information may also include the location and size
of device memory, which is also checked when probing the device,
and/or a dma channel 
.Ns ( Dq drq ) .
Some configuration parameters must be set to agree with the hardware
configuration.
Other parameters may cause the hardware to be configured according
to the kernel configuration.
See the individual manual pages for the devices for configuration information.
.Pp
Options are available to obtain additional information about the
autoconfiguration process and/or to avoid probing individual devices.
This is controlled by the
.Li -autodebug
value given to the boot program (see
.Xr boot 8 ) .
A value of 1 causes verbose output including each device and location
probed and the outcome.
The autoconfiguration output is paginated in this mode, requiring a key
to be pressed after each screen.
A value of 2 causes confirmation to be requested before probing each
device and location in addition to the verbose output.
These options may be useful in debugging failures during autoconfiguration.
.Pp
Normally, the system uses the disk partition from which it was loaded
as the root filesystem.
If the
.Dv RB_DFLTROOT
option is specified (see
.Xr reboot 2 ) ,
the system will instead use the pre-configured root device.
If a GENERIC system is booted with the
.Dv RB_ASKNAME
option,
then the name of the root device is read from the console terminal at boot
time, and any available device may be used.
.Sh DIAGNOSTICS
.Bl -diag
.It isa0 (root)
The primary system bus is an ISA bus.
.It isa0 (root): eisa
The primary system bus is an EISA bus.
.It %s%d at isa0 iobase 0x%x irq %d drq %d maddr 0x%x-0x%x
A device with the specified i/o base address, interrupt level, dma request
level and memory mapped region was found.  Fields that are meaningless for
a particular device are omitted.
.It "Warning: probe of %s%d may have modified ports 0x%x - 0x%x, already in use"
An attempt to probe a device failed because some of the ports required
had already been claimed by a previous device.
This could cause problems in operation of the device owning the ports
in the specified range.
.Pp
.It fd%d at fdc%d slave %d
A floppy disk attached to the specified floppy controller was found.
.Pp
.It wd%d at wdc%d slave %d
A winchester disk attached to the specified controller was found.
.Pp
.It %s%d at tg%d unit %d: inquiry-info
A SCSI disk or tape was found at the specified SCSI target number.  The
inquiry-info is the string returned by the SCSI Inquiry command.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr boot 8 ,
.Xr config 8
.Sh HISTORY
The
.Nm
feature
first appeared in
.Bx 4.1 .
The current version is based on work done at Lawrence Berkeley Laboratory.
