share/man/man4/man4.i386/intro.4
.\"	BSDI $Id: intro.4,v 1.2 1993/03/23 22:56:23 polk Exp $
.\"
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)intro.4	6.6 (Berkeley) 3/27/91
.\"
.Dd March 23, 1993
.Dt INTRO 4 i386
.Os BSD/386
.Sh NAME
.Nm intro
.Nd introduction to special files and hardware support
.Sh DESCRIPTION
This section describes the special files, related driver functions,
and networking support
available in the system.
In this part of the manual, the
.Tn SYNOPSIS
section of
each configurable device gives a sample specification
for use in constructing a system description for the
.Xr config 8
program.
The
.Tn DIAGNOSTICS
section lists messages which may appear on the console
and/or in the system error log
.Pa /var/log/messages
due to errors in device operation;
see
.Xr syslogd 8
for more information.
.Sh ISA and EISA DEVICE SUPPORT
This section describes the hardware supported on ISA and EISA bus computers
using the Intel 386 or 486.
Software support for these devices comes in two forms.  A hardware
device may be supported with a
.Em character
or
.Em block device driver ,
or it may be used within the networking subsystem and have a
.Em network interface driver .
Block and character devices are accessed through files in the file
system of a special type; see
.Xr mknod 8 .
Network interfaces are indirectly accessed through the interprocess
communication facilities provided by the system; see
.Xr socket 2 .
.Pp
A hardware device is identified to the system at configuration time
and the appropriate device or network interface driver is then compiled
into the system.  When the resultant system is booted, the
autoconfiguration facilities in the system probe for the device,
and, if found, enable the software
support for it.  If a
device does not respond at autoconfiguration
time it is not accessible at any time afterwards.  To
enable a
device which did not autoconfigure, the system will have to
be rebooted.
.Pp
The autoconfiguration system is described in
.Xr autoconf 4 .
A list of the supported devices is given below.
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr autoconf 4 ,
.Xr config 8 .
.Rs
.%T "Building 4.3 BSD UNIX Systems with Config"
.%B SMM
.%N 2
.Re
.Sh LIST OF DEVICES
The devices listed below are supported in this incarnation of
the system.  Pseudo-devices are not listed.
.Pp
.Bl -column midi -offset indent
aha	Adaptec AHA-1542B SCSI host adapter
bms	Microsoft bus mouse
com	8251/16450/16550 based async ports, including AST multiplexor cards
eaha	Adaptec AHA-1742A SCSI host adapter
ef	3COM 3c509 Ethernet
el	3COM 3c507 Ethernet
eo	3COM 3c501 Ethernet
ep	3COM 3c505 Ethernet
ex	Intel EtherExpress 16 Ethernet
fd	standard floppy disk drive: 360k, 1.2m, 1.44m
kbd	console keyboard (normally make-break mode)
lms	Logitech bus mouse
lp	parallel line printer
mcd	Mitsumi ISA CD-ROM
midi	MusicQuest midi interface
ms	Maxpeed async multiplexor
ne	NE-1000/NE-2000 Ethernet
npx	387 or 486 internal math coprocessor
pccons	console display (text mode, mono or color)
pe	Xircom PE2 parallel port Ethernet
rc	SDL Communications RISCom/N8 async multiplexor
rh	SDL Communications RISCom/H2 HDLC network interface
rn	SDL Communications RISCom/N1 HDLC network interface
sd	generic SCSI disk
st	generic SCSI tape
vga	VGA display including standard, super and accelerated
wd	ST-506, RLL, ESDI, MFM or IDE disk
we	Western Digital/SMC WD80*3 series and 3COM 3c503 Ethernet
wt	ISA QIC-02 interface quarter inch tape
.El
