usr.sbin/rwhod/rwhod.8
.\"	BSDI $Id: rwhod.8,v 1.3 1994/01/06 17:15:35 torek Exp $
.\"
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)rwhod.8	6.5 (Berkeley) 3/16/91
.\"
.Dd March 16, 1991
.Dt RWHOD 8
.Os BSD 4.2
.Sh NAME
.Nm rwhod
.Nd system status server
.Sh SYNOPSIS
.Nm
.br
.Nm
.Fl m
.br
.Nm
.Fl M Ar ttl
.Sh DESCRIPTION
The
.Nm
server maintains the database used by the
.Xr rwho 1
and
.Xr ruptime 1
programs.  Its operation is predicated on the ability to
.Em broadcast
or
.Em multicast
messages on a network.
.Pp
The
.Nm
program operates as both a producer and consumer of status information.
As a producer of information it periodically
queries the state of the system and constructs
status messages which are broadcast or multicast on a network.
As a consumer of information, it listens for other
.Nm
servers' status messages, validating them, then recording
them in a collection of files located in the directory
.Pa /var/rwho .
.Pp
The
.Fl m
and
.Fl M
flags configure
.Nm
to use multicast rather than broadcast.
Under
.Fl m ,
.Nm
sends its multicast message to all multicast-capable interfaces
(those with
.Dv IFF_MULTICAST
set in their flags; see
.Xr ifconfig 8 ).
In this case the time-to-live is fixed at 1,
preventing the multicast from being forwarded beyond
any directly-connected subnets.
With
.Fl M ,
.Nm
sends its multicast message with the given
.Ar ttl
as its time to live, but to the
.Dq whod
group
.Pq Dv 224.0.1.3
rather than individually to each interface.
This is intended to be used with a multicast router
which will distribute the message to members of the multicast group.
.Pp
In any mode, broadcast or multicast,
.Nm
will accept all forms of reports.
This means that if broadcast and multicast
.Nm
servers are combined on one network,
the multicast-capable systems will see everyone,
while the broadcast-only machines will see only each other.
.Pp
The server transmits and receives messages at the port indicated
in the ``rwho'' service specification; see 
.Xr services 5 .
The messages sent and received are of the form:
.Bd -literal -offset indent
struct	outmp {
	char	out_line[8];		/* tty name */
	char	out_name[8];		/* user id */
	long	out_time;		/* time on */
};

struct	whod {
	char	wd_vers;
	char	wd_type;
	char	wd_fill[2];
	int	wd_sendtime;
	int	wd_recvtime;
	char	wd_hostname[32];
	int	wd_loadav[3];
	int	wd_boottime;
	struct	whoent {
		struct	outmp we_utmp;
		int	we_idle;
	} wd_we[1024 / sizeof (struct whoent)];
};
.Ed
.Pp
All fields are converted to network byte order prior to
transmission.  The load averages are as calculated by the
.Xr w 1
program, and represent load averages over the 5, 10, and 15 minute 
intervals prior to a server's transmission; they are multiplied by 100
for representation in an integer.  The host name
included is that returned by the
.Xr gethostname 2
system call, with any trailing domain name omitted.
The array at the end of the message contains information about
the users logged in to the sending machine.  This information 
includes the contents of the 
.Xr utmp 5
entry for each non-idle terminal line and a value indicating the
time in seconds since a character was last received on the terminal line.
.Pp
Messages received by the
.Xr rwho
server are discarded unless they originated at an
.Xr rwho
server's port.  In addition, if the host's name, as specified
in the message, contains any unprintable
.Tn ASCII
characters, the
message is discarded.  Valid messages received by
.Nm rwhod
are placed in files named
.Pa whod.hostname
in the directory
.Pa /var/rwho .
These files contain only the most recent message, in the
format described above.
.Pp
Status messages are generated approximately once every
3 minutes.
.Nm Rwhod
performs an
.Xr nlist 3
on
.Pa /bsd
every 30 minutes to guard against
the possibility that this file is not the system
image currently operating.
.Sh SEE ALSO
.Xr mrouted 8 ,
.Xr rwho 1 ,
.Xr ruptime 1
.Sh BUGS
Status information should be sent only upon request rather than continuously.
People often interpret the server dying
or network communtication failures
as a machine going down.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
The multicast additions are from Stanford University.
